[
  {
    "starterId": "starter_seeing_like_a_state",
    "title": "Seeing Like a State",
    "author": "James C. Scott",
    "description": "A critique of high-modernist state planning, showing how attempts to make societies 'legible' often fail because they ignore local knowledge, complexity, and real human practices.",
    "coverImageUrl": "https://m.media-amazon.com/images/I/71QBiANdU-L._AC_UF1000,1000_QL80_.jpg",
    "thumbnailUrl": "https://m.media-amazon.com/images/I/71QBiANdU-L._AC_UF1000,1000_QL80_.jpg",
    "ideas": [
        {
              "id": "i1",
              "title": "State Legibility",
              "description": "States simplify complex societies into standardized categories—surveys, maps, surnames—to make populations manageable and taxable, but these simplifications distort reality.",
              "importance": "foundation",
              "depthTarget": 3
            },
            {
              "id": "i2",
              "title": "High-Modernist Ideology",
              "description": "A belief in scientific, technical, top-down design as the superior way to organize society, marked by confidence in expertise and an urge to redesign social life for efficiency.",
              "importance": "foundation",
              "depthTarget": 3
            },
            {
              "id": "i3",
              "title": "Authoritarian State Power",
              "description": "High-modernist schemes require a powerful state that can override local practices, enforce simplifications, and compel participation, often leading to coercion.",
              "importance": "buildingBlock",
              "depthTarget": 3
            },
            {
              "id": "i4",
              "title": "Weak Civil Society Preconditions",
              "description": "Top-down planning succeeds only when civil society is weak, preventing local communities from resisting reforms that destroy their lived systems of cooperation.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i5",
              "title": "Case Study: Scientific Forestry",
              "description": "German forestry replaced messy natural forests with tidy monoculture grids to maximize timber yield, but ignored ecological complexity, causing long-term collapse.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i6",
              "title": "Monoculture of Simplification",
              "description": "Large-scale rationalization creates order that is easy for planners to read but fragile, because diverse, local, adaptive systems are replaced with rigid uniformity.",
              "importance": "foundation",
              "depthTarget": 2
            },
            {
              "id": "i7",
              "title": "Case Study: The Village as a Grid",
              "description": "States replace organically evolved settlements with geometric layouts, ignoring the social networks embedded in irregular patterns that support cooperation and survival.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i8",
              "title": "Case Study: Agriculture Collectivization",
              "description": "Soviet collectivization imposed uniform farms and quotas, destroying local farming knowledge, incentives, and tacit skills—leading to inefficiency and famine.",
              "importance": "foundation",
              "depthTarget": 3
            },
            {
              "id": "i9",
              "title": "Case Study: Ujamaa Villagization",
              "description": "Tanzania forcibly relocated dispersed farmers into planned villages, ignoring ecological logic behind old settlement patterns and crippling agricultural productivity.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i10",
              "title": "Simplified Subjects",
              "description": "To implement large schemes, states reduce citizens to thin categories—worker, farmer, taxpayer—ignoring real motives, skills, identities, and relationships.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i11",
              "title": "Local Practical Knowledge (Mētis)",
              "description": "Mētis is contextual, experience-based know-how that enables people to navigate environments successfully; it cannot be fully captured by formal rules.",
              "importance": "foundation",
              "depthTarget": 3
            },
            {
              "id": "i12",
              "title": "Limits of Technical Knowledge",
              "description": "Formal, scientific knowledge offers models and abstractions but fails when applied without the lived understanding that local actors possess.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i13",
              "title": "Resistance of Local Practices",
              "description": "Traditional arrangements often persist or reappear because they encode mētis—social learning that planners wrongly interpret as irrational or backward.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i14",
              "title": "Unintended Consequences",
              "description": "Large-scale simplifications produce unpredictable failures because planners cannot anticipate interactions within complex social and ecological systems.",
              "importance": "foundation",
              "depthTarget": 2
            },
            {
              "id": "i15",
              "title": "Thin vs Thick Descriptions",
              "description": "States rely on thin, surface-level categories, while real understanding of social life requires thick, contextual, richly descriptive knowledge.",
              "importance": "enhancement",
              "depthTarget": 2
            },
            {
              "id": "i16",
              "title": "Human Agency in Planned Systems",
              "description": "People adapt, circumvent, and reinterpret imposed rules, turning planned systems into something different from what designers intended.",
              "importance": "enhancement",
              "depthTarget": 2
            },
            {
              "id": "i17",
              "title": "Fragility of Large Schemes",
              "description": "Top-down plans create brittle systems that fail catastrophically when real-world variation and local improvisation are suppressed.",
              "importance": "buildingBlock",
              "depthTarget": 3
            },
            {
              "id": "i18",
              "title": "Role of Feedback and Adaptation",
              "description": "Healthy systems include feedback loops that allow for correction and local experimentation, something large centralized schemes suppress.",
              "importance": "buildingBlock",
              "depthTarget": 2
            },
            {
              "id": "i19",
              "title": "Pluralism over Uniformity",
              "description": "Diverse, decentralized, small-scale solutions outperform single grand designs because they can evolve, fail safely, and incorporate local knowledge.",
              "importance": "foundation",
              "depthTarget": 2
            },
            {
              "id": "i20",
              "title": "Failures of High-Modernist Urbanism",
              "description": "City plans like Brasília or Le Corbusier’s Radiant City imposed geometric order but ignored how people actually interact, creating lifeless, impractical environments.",
              "importance": "enhancement",
              "depthTarget": 2
            },
            {
              "id": "i21",
              "title": "Complexity of Real Social Systems",
              "description": "Organic social orders evolve through countless small adjustments; no planner can anticipate all the tacit knowledge embedded in these patterns.",
              "importance": "foundation",
              "depthTarget": 3
            },
            {
              "id": "i22",
              "title": "Cautions for Reformers",
              "description": "Effective reform requires humility, experimentation, and local participation, not sweeping transformations based on abstract models.",
              "importance": "enhancement",
              "depthTarget": 2
            }    ]
  },
  {
    "starterId": "starter_thinking_fast_slow",
    "title": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "description": "A tour of how fast, intuitive System 1 and slow, deliberate System 2 shape our judgments and choices, and how their interaction leads to systematic biases in decision-making and memory.",
    "coverImageUrl": "https://m.media-amazon.com/images/I/71f6DceqZAL.jpg",
    "thumbnailUrl": "https://m.media-amazon.com/images/I/71f6DceqZAL.jpg",
    "ideas": [
      {
        "id": "i1",
        "title": "System 1 and System 2",
        "description": "Two interacting modes of thinking: fast, automatic, intuitive System 1 and slow, deliberate, effortful System 2, with System 2 often endorsing System 1’s quick impressions.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i2",
        "title": "Attention and Effort",
        "description": "System 2 requires limited mental energy and focused attention, so when tasks are demanding, people are more likely to default to shortcuts from System 1.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i3",
        "title": "Lazy System 2",
        "description": "System 2 tends to conserve effort and usually accepts System 1’s suggestions unless there is a clear reason to intervene, making bias correction rare by default.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i4",
        "title": "Associative Machine",
        "description": "System 1 constantly links ideas, emotions, and memories into coherent stories, so subtle primes—words, images, or moods—can shift judgments without our awareness.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i5",
        "title": "Cognitive Ease",
        "description": "Information that feels familiar and easy to process is judged as more true and safe, while effortful processing creates doubt and can trigger more careful thinking.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i6",
        "title": "Norms and Causes",
        "description": "System 1 quickly classifies events as normal or surprising and invents simple causal stories, often underplaying randomness and complexity.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i7",
        "title": "What You See Is All There Is",
        "description": "System 1 acts on the information that is salient and available, ignoring what is missing, so we build confident stories from incomplete data instead of seeking further evidence.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i8",
        "title": "Question Substitution",
        "description": "When asked a hard question, the mind often unconsciously substitutes an easier one—such as 'How do I feel about this?'—and answers that instead.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i9",
        "title": "Law of Small Numbers",
        "description": "People expect small samples to faithfully represent the population, so they overinterpret streaks and anomalies that are mostly just statistical noise.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i10",
        "title": "Anchoring",
        "description": "Initial numbers, even if arbitrary, pull subsequent judgments toward them, biasing estimates in negotiations, pricing, and forecasting.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i11",
        "title": "Availability Heuristic",
        "description": "Judgments of frequency and risk are driven by how easily examples come to mind, so vivid or recent events feel more common than they really are.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i12",
        "title": "Representativeness Heuristic",
        "description": "People judge probabilities by similarity to stereotypes, leading to neglect of base rates and misunderstanding of randomness.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i13",
        "title": "Conjunction Fallacy",
        "description": "Because detailed stories feel more representative, people often judge a specific scenario as more likely than a broader one that logically includes it.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i14",
        "title": "Regression to the Mean",
        "description": "Extreme performances or outcomes tend to be followed by more average ones, but people mistakenly attribute this to interventions instead of statistics.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i15",
        "title": "Illusion of Validity",
        "description": "Confidence in a judgment is driven by the coherence of the story, not actual accuracy, so experts often feel sure even when their predictions are poor.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i16",
        "title": "Hindsight and Narrative Fallacy",
        "description": "In hindsight, people weave narratives that make events seem predictable and inevitable, reinforcing overconfidence in their ability to foresee complex outcomes.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i17",
        "title": "Planning Fallacy",
        "description": "Individuals and organizations underestimate time, cost, and risks by focusing on optimistic inside views instead of using outside statistical baselines.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i18",
        "title": "Prospect Theory",
        "description": "A model of decision-making in which outcomes are evaluated as gains or losses relative to a reference point, with diminishing sensitivity and loss aversion shaping choices.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i19",
        "title": "Reference Points",
        "description": "People evaluate outcomes relative to a changing baseline—such as current wealth or expectations—rather than in absolute terms.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i20",
        "title": "Loss Aversion",
        "description": "Losses loom larger than equivalent gains, making people risk-averse for gains but risk-seeking when trying to avoid losses.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i21",
        "title": "Endowment Effect and Status Quo Bias",
        "description": "People value what they already own more than identical items they do not, and they overweight the disadvantages of change, leading to inertia.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i22",
        "title": "Framing Effects",
        "description": "Logically equivalent descriptions—such as survival rates versus mortality rates—can lead to different preferences, because choices depend on whether options are framed as gains or losses.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i23",
        "title": "Mental Accounting",
        "description": "People mentally partition money and outcomes into separate 'accounts' and evaluate decisions locally, often leading to globally inconsistent choices.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i24",
        "title": "Probability Weighting and Rare Events",
        "description": "People overweight small probabilities and underweight moderate and high ones, helping explain behaviors like buying both lottery tickets and insurance.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i25",
        "title": "Experiencing vs Remembering Self",
        "description": "The experiencing self lives in the present moment, while the remembering self constructs stories about episodes and largely determines future choices.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i26",
        "title": "Peak-End Rule and Duration Neglect",
        "description": "Memory of an experience depends mostly on its most intense moment and how it ended, with duration playing little role in the remembered evaluation.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i27",
        "title": "Focusing Illusion",
        "description": "When thinking about one aspect of life—like income or location—people temporarily exaggerate its impact on happiness, forgetting that many other factors matter too.",
        "importance": "enhancement",
        "depthTarget": 2
      }
    ]
  },
  {
    "starterId": "starter_selfish_gene",
    "title": "The Selfish Gene",
    "author": "Richard Dawkins",
    "description": "An explanation of evolution from the perspective of genes as replicators, showing how gene-level selection can produce cooperation, altruism, conflict, and cultural evolution.",
    "coverImageUrl": "https://m.media-amazon.com/images/I/81yWNVpjkmL._AC_UF1000,1000_QL80_.jpg",
    "thumbnailUrl": "https://m.media-amazon.com/images/I/81yWNVpjkmL._AC_UF1000,1000_QL80_.jpg",
    "ideas": [
      {
        "id": "i1",
        "title": "Gene-Centred View",
        "description": "Natural selection is best understood at the level of genes, which persist across generations while organisms are temporary vehicles that genes build.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i2",
        "title": "Replicators and Survival Machines",
        "description": "Early evolution involved self-copying molecules—replicators—that later built protective 'survival machines' (organisms) to improve their replication chances.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i3",
        "title": "Selfish Gene Metaphor",
        "description": "Calling genes 'selfish' means that genes which promote their own replication spread, even if the behaviors they produce look cooperative or altruistic at the organism level.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i4",
        "title": "Gene vs Group Selection",
        "description": "Many phenomena that look like group-level selection can be explained more cleanly by genes promoting strategies that help copies of themselves, without invoking sacrifice for the group as a whole.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i5",
        "title": "Altruism as Genetic Strategy",
        "description": "Apparent altruism—helping others at a cost to oneself—can evolve when the beneficiaries carry copies of the same genes, turning self-sacrifice into indirect genetic self-interest.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i6",
        "title": "Inclusive Fitness",
        "description": "An individual’s genetic success includes not only its own reproduction but also the reproduction of relatives who share its genes, broadening what 'fitness' means.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i7",
        "title": "Hamilton’s Rule",
        "description": "A gene for altruism spreads when the cost to the helper is less than the benefit to the recipient multiplied by their genetic relatedness (C < r × B).",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i8",
        "title": "Kin Selection",
        "description": "Selection favoring behaviors that help genetic relatives explains patterns like worker ants helping their queen or animals risking themselves for siblings.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i9",
        "title": "Evolutionarily Stable Strategy",
        "description": "An evolutionarily stable strategy (ESS) is a behavioral strategy that, once common, cannot be invaded by alternatives, providing a game-theoretic tool for analyzing social behavior.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i10",
        "title": "Hawk-Dove Model",
        "description": "A simple game where aggressive 'hawks' and peaceful 'doves' interact shows how mixes of strategies can be stable, depending on the costs and benefits of fighting.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i11",
        "title": "Reciprocal Altruism",
        "description": "Helping unrelated individuals can evolve when interactions are repeated and aid is likely to be repaid, making cooperation a long-run beneficial strategy.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i12",
        "title": "Tit-for-Tat Strategy",
        "description": "In repeated interactions, a simple rule—cooperate on the first move, then copy your partner’s last move—can be an effective and stable strategy for reciprocal altruism.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i13",
        "title": "Parent-Offspring Conflict",
        "description": "Parents and offspring share genes but not all of them, creating conflicts over resources like weaning time because each has slightly different genetic interests.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i14",
        "title": "Sibling Rivalry",
        "description": "Siblings may compete for parental investment because each is more related to itself than to its siblings, though shared genes can also promote cooperation when it benefits them all.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i15",
        "title": "Sexual Selection",
        "description": "Differences in parental investment between males and females drive traits like competition among males and choosiness among females, shaping elaborate displays and behaviors.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i16",
        "title": "Sex Ratios and Strategy",
        "description": "Genes can spread by influencing the proportion of sons and daughters produced when certain sex ratios yield higher expected genetic payoff.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i17",
        "title": "Extended Phenotype",
        "description": "A gene’s effects can extend beyond the body—into structures like beaver dams or manipulated host behavior—so these external effects are also part of what selection acts on.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i18",
        "title": "Memes as Cultural Replicators",
        "description": "Memes—ideas, tunes, and practices—replicate by spreading between minds, undergoing selection pressures analogous to those acting on genes.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i19",
        "title": "Misreading the Metaphor",
        "description": "Understanding that genes are 'selfish' is a descriptive model, not a moral prescription, and does not justify selfish behavior in human ethics.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i20",
        "title": "Gene-Level Thinking Tool",
        "description": "Thinking in terms of gene interests helps clarify puzzles in behavior, cooperation, and design that are harder to explain with organism- or group-centred views alone.",
        "importance": "enhancement",
        "depthTarget": 2
      }
    ]
  },
  {
    "starterId": "starter_beginning_infinity",
    "title": "The Beginning of Infinity",
    "author": "David Deutsch",
    "description": "A philosophy of knowledge and progress arguing that good explanations, open-ended criticism, and human creativity can lead to unbounded scientific, technological, and moral improvement.",
    "coverImageUrl": "https://m.media-amazon.com/images/I/818fIMXxgOL.jpg",
    "thumbnailUrl": "https://m.media-amazon.com/images/I/818fIMXxgOL.jpg",
    "ideas": [
      {
        "id": "i1",
        "title": "Reach of Explanations",
        "description": "Explanations are accounts of how the world works that apply far beyond the specific observations that first suggested them, giving them wide reach.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i2",
        "title": "Good vs Bad Explanations",
        "description": "Good explanations are hard to vary while still explaining the same facts, whereas bad ones can be easily adjusted to fit any outcome and therefore explain little.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i3",
        "title": "Fallibilism",
        "description": "All knowledge is conjectural and subject to error, so progress depends on exposing ideas to criticism and improvement rather than seeking certainty or justification.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i4",
        "title": "Problem-Solving View",
        "description": "Knowledge grows through a cycle of proposing solutions to problems, criticizing them, and correcting errors, not through passive observation or induction from data alone.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i5",
        "title": "Reality of Abstractions",
        "description": "Abstract entities like numbers, software, and scientific laws are real in the sense that they have causal and explanatory roles that cannot be reduced to individual physical instances.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i6",
        "title": "Jumps to Universality",
        "description": "Some systems—like universal computers—reach a point where they can emulate any process of a given kind, making further improvements matters of efficiency rather than kind.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i7",
        "title": "Universal Computers and Constructors",
        "description": "Given the right knowledge and resources, universal computers and constructors can carry out any physically allowed computation or transformation.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i8",
        "title": "People as Universal Explainers",
        "description": "Humans are unique in being able to create explanations of arbitrary depth and scope, making them universal explainers whose only limits are knowledge and creativity.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i9",
        "title": "Creativity over Induction",
        "description": "New ideas are not mechanically derived from data; they are creative conjectures that are then tested, so inductive rules cannot replace imaginative explanation.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i10",
        "title": "Beginning of Infinity",
        "description": "If knowledge creation is open-ended, then any stage of progress is just the beginning of an unlimited sequence of further improvements in understanding and capability.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i11",
        "title": "Optimism about Problems",
        "description": "Problems are inevitable but solvable in principle, so rational optimism treats difficulties as prompts for knowledge-creation rather than signs of ultimate limits.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i12",
        "title": "Multiverse Interpretation",
        "description": "Quantum theory is best understood as describing a multiverse of branching histories, which explains interference and probability more naturally than single-universe views.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i13",
        "title": "Anthropic Reasoning",
        "description": "Anthropic explanations—appealing to the conditions needed for observers to exist—are legitimate only when embedded in detailed, testable physical theories.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i14",
        "title": "Static vs Dynamic Societies",
        "description": "Static societies seek to freeze traditions and suppress new ideas, while dynamic societies institutionalize criticism and change, enabling unbounded progress.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i15",
        "title": "Rational and Anti-Rational Memes",
        "description": "Cultural ideas can either encourage criticism and improvement or suppress them; anti-rational memes spread by blocking criticism rather than by being true.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i16",
        "title": "Moral Knowledge as Explanatory",
        "description": "Moral truths, if they exist, are discovered and improved through the same process of conjecture and criticism as scientific truths, not by authority or revelation.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i17",
        "title": "Unsustainability as Knowledge Problem",
        "description": "Resource and environmental limits are ultimately problems of inadequate knowledge about how to use resources better, not fixed ceilings on progress.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i18",
        "title": "Beauty as Guide to Truth",
        "description": "Aesthetic judgments in science—like elegance and simplicity—often correlate with deeper, more unified explanations, though they remain fallible guides.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i19",
        "title": "Error-Correcting Institutions",
        "description": "Good political and social institutions are those that make it easy to detect and correct errors through criticism, free speech, and checks and balances.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i20",
        "title": "Explanation over Prediction",
        "description": "Predictive success alone is not enough; theories must also explain why things happen, because shallow curve-fitting without explanation is fragile.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i21",
        "title": "Universality of Reason",
        "description": "Any universal explainer can in principle understand the explanations of any other, so reason is not confined to one culture or species.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i22",
        "title": "Open-Ended Progress",
        "description": "As long as we preserve traditions of criticism and creativity, we can expect unending improvement in science, technology, and morality, with each solved problem revealing better new problems.",
        "importance": "foundation",
        "depthTarget": 3
      }
    ]
  },
  {
    "starterId": "starter_antifragile",
    "title": "Antifragile",
    "author": "Nassim Nicholas Taleb",
    "description": "A framework for understanding systems that benefit from volatility, randomness, and stress, and for designing lives, portfolios, and institutions that gain from disorder.",
    "coverImageUrl": "https://m.media-amazon.com/images/I/81MS6HSVdsL.jpg",
    "thumbnailUrl": "https://m.media-amazon.com/images/I/81MS6HSVdsL.jpg",
    "ideas": [
      {
        "id": "i1",
        "title": "Fragile Robust Antifragile",
        "description": "Fragile things are harmed by volatility, robust things resist it, and antifragile things actually benefit from shocks and variability.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i2",
        "title": "Nonlinearity and Convexity",
        "description": "When responses to stressors are nonlinear, small shocks can help while large ones harm, and convex payoff structures—limited downside with large upside—create antifragility to randomness.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i3",
        "title": "Hormesis and Overcompensation",
        "description": "Biological and social systems often overcompensate to small stressors—like muscles growing stronger after being stressed—illustrating hormesis when stress is applied in the right dose.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i4",
        "title": "Randomness as Information",
        "description": "Noise and volatility reveal hidden fragilities and help robust and antifragile strategies outcompete fragile ones, so randomness is a source of information, not just a nuisance.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i5",
        "title": "Turkey Problem",
        "description": "Apparent stability—like a turkey being fed every day—can hide growing fragility, so rare, extreme events can abruptly destroy systems that looked safe based on past data.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i6",
        "title": "Redundancy as Insurance",
        "description": "Redundancy—extra reserves, slack, and backup systems—is a feature, not a bug, because it allows systems to survive and benefit from shocks that would destroy optimized, lean designs.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i7",
        "title": "Barbell Strategy",
        "description": "A barbell approach combines extreme safety on one side with small, speculative bets on the other, avoiding medium risk and creating overall antifragility to shocks and errors in forecasting.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i8",
        "title": "Optionality",
        "description": "Having many options with limited downside and open-ended upside lets you benefit from randomness without needing accurate predictions about specific events.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i9",
        "title": "Trial and Error",
        "description": "Systematic trial-and-error with small, reversible bets is a powerful way to discover antifragile opportunities in uncertain domains.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i10",
        "title": "Non-Predictive Decisions",
        "description": "Taleb advocates judging decisions by their exposure to harm or benefit—via payoff profiles—rather than by whether predictions come true.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i11",
        "title": "Iatrogenics",
        "description": "Interventions, especially in medicine and policy, can cause more harm than the problem itself, so sometimes the antifragile choice is to do less or nothing.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i12",
        "title": "Naive Interventionism",
        "description": "Taleb calls 'fragilistas' those who add complex interventions and controls without understanding their limits, often increasing hidden fragility while claiming to stabilize systems.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i13",
        "title": "Hidden Fragility in Complexity",
        "description": "Layered financial instruments, overengineered technologies, and opaque regulations can hide fragility, making simple and transparent structures safer.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i14",
        "title": "Scale and Small Units",
        "description": "Smaller units—city-states, local businesses, modular components—are often more antifragile because failures are contained, while large, tightly coupled systems suffer from cascading breakdowns.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i15",
        "title": "Decentralization and Local Knowledge",
        "description": "Decentralized, bottom-up decision-making harnesses local knowledge and allows parallel experimentation, while centralized control magnifies errors and fragility.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i16",
        "title": "Lindy Effect",
        "description": "For non-perishable things like books or technologies, the longer they have survived, the longer they are expected to survive, making 'time-tested' options often more robust.",
        "importance": "buildingBlock",
        "depthTarget": 2
      },
      {
        "id": "i17",
        "title": "Via Negativa",
        "description": "Removing sources of fragility—like debt, excess complexity, or toxic habits—is often more effective than adding new interventions, because what is absent cannot harm you.",
        "importance": "foundation",
        "depthTarget": 2
      },
      {
        "id": "i18",
        "title": "Skin in the Game",
        "description": "Systems become fragile when decision-makers do not bear the consequences of their errors, so requiring 'skin in the game' aligns incentives and filters out harmful strategies over time.",
        "importance": "foundation",
        "depthTarget": 3
      },
      {
        "id": "i19",
        "title": "Ethics of Skin in the Game",
        "description": "Ethically, no one should be able to expose others to large risks without bearing comparable risks themselves, making 'skin in the game' a moral principle, not just a heuristic.",
        "importance": "buildingBlock",
        "depthTarget": 3
      },
      {
        "id": "i20",
        "title": "Green Lumber Problem",
        "description": "Success in complex domains often comes from exploiting payoff structures rather than fully understanding causal stories, as in traders who profit from patterns they cannot explain well.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i21",
        "title": "Antifragile Careers",
        "description": "Designing a career with multiple options, low fixed costs, and small experiments creates antifragility, whereas single-track, high-commitment paths are fragile to shocks.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i22",
        "title": "Stoic Practices",
        "description": "Stoic habits—like rehearsing worst cases and lowering dependence on externals—can make people emotionally antifragile by turning setbacks into training rather than trauma.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i23",
        "title": "Barbells in Life and Innovation",
        "description": "The barbell pattern—extreme safety plus small, risky bets—applies beyond finance to innovation, career, and personal projects, protecting the downside while keeping upside open.",
        "importance": "enhancement",
        "depthTarget": 2
      },
      {
        "id": "i24",
        "title": "Designing Antifragile Systems",
        "description": "We can deliberately design systems to benefit from disorder by combining convex payoffs, redundancy, decentralization, skin in the game, and via negativa.",
        "importance": "foundation",
        "depthTarget": 3
      }
    ]
  }
]
